Revit 2027 API
MEPAnalyticalSegment.OverrideType Property
 The override type of analytical segment pressure loss calculation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SegmentOverrideType OverrideType { get; }
Public ReadOnly Property OverrideType As SegmentOverrideType
	Get
public:
property SegmentOverrideType OverrideType {
	SegmentOverrideType get ();
}
member OverrideType : SegmentOverrideType with get
Property Value
SegmentOverrideType
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace